---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoof
source: html/347bb122-9f6c-ee90-edfb-7f43aaa4569f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoof Property

The roof cannot be joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinRoof { get; }
```